# -*- org-confirm-babel-evaluate: nil -*-
#+TITLE: Phundrak’s i3 config
#+INCLUDE: headers.org
#+OPTIONS: auto-id:t
#+HTML_HEAD_EXTRA: <meta name="description" content="Phundrak's i3 config" />
#+HTML_HEAD_EXTRA: <meta property="og:title" content="Phundrak's i3 config" />
#+HTML_HEAD_EXTRA: <meta property="og:description" content="Description of the i3 config file of Phundrak" />
#+PROPERTY: header-args :noweb yes :exports code :tangle ~/.config/i3/config :comments link
#+PROPERTY: header-args:emacs-lisp :exports none :tangle no
#+STARTUP: content

** Global
   :PROPERTIES:
   :CUSTOM_ID: h-dda00dd9-90e4-460b-b49c-8939c1ae11ce
   :END:
   The first I  do is declaring the modifier  key and the alt key  —I don’t find
   the names =Mod1=  and =Mod4= to be  explicit enough. This will  map =$mod= to
   the Super  key (or as some  people unfortunately call it,  the /Windows/ key)
   and =$alt= to  the Alt key.

   Let’s  also  bind the  =$up=,  =$down=,  =$left=  and =$right=  variables  to
   respectively the up,  down, left, and right arrows on  the keyboard. Why bind
   them to  variables? If I  ever want  to modify the  arrow keys to  some other
   keys, like  =é=, =a=,  =u=, and  =i= (the  equivalent of  =wqsd= on  the bépo
   layout) or  =c=, =t=,  =s=, and  =r= (the  equivalent of  =hjkl= on  the bépo
   layout), I will just have to modify these four lines.

   I’ll also set the  =$term= variable. A lot of shortcuts in  my i3 config rely
   on the terminal emulator itself to  launch commands in the terminal, and thus
   call the terminal itself. If I ever  need to move from my current terminal, I
   will just have to change the name of the executable here.

   #+NAME: variable-table
   | variable | value |
   |----------+-------|
   | $mod     | Mod4  |
   | $alt     | Mod1  |
   | $up      | Up    |
   | $down    | Down  |
   | $left    | Left  |
   | $right   | Right |
   | $term    | st    |

   #+NAME: variable-sh
   | variable    | value                                                                    |
   |-------------+--------------------------------------------------------------------------|
   | $exiti3     | i3-nagbar -t warning -m 'Leave i3?' -b 'Yes' 'i3-msg exit'               |
   | $lockscreen | Lucien Cartier-Tilet\n(Phuntsok Drak-pa)\n+33 (0)6 83 90 56 89           |
   | $rofiexec   | rofi -combi-modi 'window,drun' -show combi -mohh combi -m -1 -show-icons |
   | $mail       | emacsclient -c -e '(mu4e)' -n                                            |
   | $ec         | emacsclient -c -n                                                        |
   | $walset     | wal -i ~/Pictures/Wallpapers -o wal-set                                  |

   Variables will be set like so.
   #+BEGIN_SRC conf :tangle no
   set $term st
   #+END_SRC

   #+NAME: generate-variables
   #+BEGIN_SRC emacs-lisp :var variables=variable-table :cache yes
     (mapconcat (lambda (x) (format "set %s %s" (car x) (cadr x)))
                variables
                "\n")
   #+END_SRC

   #+RESULTS[48079cbd7e6dbf2003fe5ae87216bd38f638b6f8]: generate-variables
   : set $mod Mod4
   : set $alt Mod1
   : set $up Up
   : set $down Down
   : set $left Left
   : set $right Right
   : set $term st

   Finally, some variables  hold some long strings for commands  I don’t want to
   have to type multiple times.
   #+NAME: generate-variables2
   #+BEGIN_SRC emacs-lisp :var variables=variable-sh :cache yes
     (mapconcat (lambda (x) (format "set %s \"%s\"" (car x) (cadr x)))
                variables
                "\n")
   #+END_SRC

   #+RESULTS[c901e3e31c500859661650e86a6b63aef286acbe]: generate-variables2
   : set $exiti3 "i3-nagbar -t warning -m 'Leave i3?' -b 'Yes' 'i3-msg exit'"
   : set $lockscreen "Lucien Cartier-Tilet\n(Phuntsok Drak-pa)\n+33 (0)6 83 90 56 89"
   : set $rofiexec "rofi -combi-modi 'window,drun' -show combi -mohh combi -m -1 -show-icons"
   : set $mail "emacsclient -c -e '(mu4e)' -n"
   : set $ec "emacsclient -c -n"
   : set $walset "wal -i ~/Pictures/Wallpapers -o wal-set"

   Here is the configuration:
   #+BEGIN_SRC conf :noweb yes
     <<generate-variables()>>
     <<generate-variables2()>>
   #+END_SRC

   Now comes  the font for the  window tiles. Honestly, this  setting is useless
   since we do not see it, but let’s set it anyway.
   #+BEGIN_SRC conf
     font Fira Sans Book:style=Book:pixelsize=10
   #+END_SRC

* Assigning windows to workspaces
  :PROPERTIES:
  :CUSTOM_ID: h-21870449-7730-4164-8add-167cb4e75218
  :END:
  I decided to bind some windows to some workspaces in order to have a better
  organization of my desktop.

  #+NAME: assignment-table
  | Application | Class       | Workspace |
  |-------------+-------------+-----------|
  | Emacs       | Emacs       |         2 |
  | Chromium    | Chromium    |         3 |
  | Firefox     | firefox     |         3 |
  | Nemo        | Nemo        |         4 |
  | Wonderdraft | Godot       |         5 |
  | Gimp        | Gimp*       |         6 |
  | Gnome Boxes | gnome-boxes |         8 |
  | Steam       | Steam       |         9 |
  | Discord     | discord     |        10 |

  The class table is used in the assignment in the i3 config file. For instance,
  Gimp’s assignment will look like this:
  #+BEGIN_SRC conf :tangle no
    assign [class="Gimp*"] 6
  #+END_SRC

  #+NAME: generate-workspaces
  #+BEGIN_SRC emacs-lisp :var workspaces=assignment-table :cache yes
    (mapconcat (lambda (x) (format "assign [class=\"%s\"] %s" (cadr x) (caddr x)))
               workspaces
               "\n")
  #+END_SRC

  #+RESULTS[0995341b013e50227edf78257ab502e46a30bc9a]: generate-workspaces
  : assign [class="Emacs"] 2
  : assign [class="Chromium"] 3
  : assign [class="firefox"] 3
  : assign [class="Nemo"] 4
  : assign [class="Godot"] 5
  : assign [class="Gimp*"] 6
  : assign [class="gnome-boxes"] 8
  : assign [class="Steam"] 9
  : assign [class="discord"] 10

  Here is the configuration:
  #+BEGIN_SRC conf :noweb yes
  <<generate-workspaces()>>
  #+END_SRC

  And although  this is not  specifically assigning a  window to a  workspace, I
  also want to have the tenth workspace  assigned to a specific output in case I
  have  two screens  — and  since this  is the  case when  I am  using only  one
  computer,  Marpa, I  will  be using  some  EmacsLisp in  order  to generate  a
  different configuration file  from this org file depending on  the name of the
  machine.
  #+NAME: ws10-output-edp1
  #+BEGIN_SRC emacs-lisp
    (if (string= system-name "Marpa")
        "workspace 10 output eDP-1"
      "")
  #+END_SRC

  Now I’ll call the above code as a noweb reference that should be executed.
  #+BEGIN_SRC conf
    <<ws10-output-edp1()>>
  #+END_SRC

* Software autolaunch
  :PROPERTIES:
  :CUSTOM_ID: h-18769c14-2ec0-41a2-9450-dae71714d0f4
  :END:
  When i3  is launched, I  want it to  also launch some  software automatically.
  Here is what we will launch:
  #+NAME: autolaunch
  | always execute it? | command                                   | what it is                             |
  |--------------------+-------------------------------------------+----------------------------------------|
  | no                 | /usr/lib/xfce-polkit/xfce-polkit          | Launch the XFCE Polkit                 |
  | no                 | picom --experimental-backends -e 1        | Launch picom                           |
  | no                 | xss-lock -- lock                          | Launch power management                |
  | no                 | numlockx on                               | Activate NumLock                       |
  | no                 | dunst -config ~/.config/dunst/dunstrc     | Launch notification manager            |
  | no                 | nm-applet                                 | NetworkManager system tray             |
  | yes                | wal -i "$(< "${HOME}/.cache/wal/wal")"    | Sets the wallpaper from last session   |
  | no                 | xrdb $HOME/.Xresources                    | Load Xresources files                  |
  | yes                | polybar-launch                            | Launch polybar                         |
  | no                 | mpc stop                                  | Stop music from mpd                    |
  | no                 | mpd_discord_richpresence --no-idle --fork | Launch mpd status sharing with Discord |

  #+NAME: generate-autolaunch
  #+BEGIN_SRC emacs-lisp :exports none :cache yes :var table=autolaunch
    (mapconcat (lambda (x)
                 (format (concat (if (string= (car x)
                                              "yes")
                                     "exec_always"
                                   "exec")
                                 " --no-startup-id %s")
                         (cadr x)))
               table
               "\n")
  #+END_SRC

  #+RESULTS[283577fe2e66b30c936b7fcf142713d285db8da6]: generate-autolaunch
  #+begin_example
  exec_always --no-startup-id wal -i "$(< "${HOME}/.cache/wal/wal")"
  exec --no-startup-id xss-lock -- i3lock -fol
  exec --no-startup-id dunst -config ~/.config/dunst/dunstrc
  exec --no-startup-id xrdb $HOME/.Xresources
  exec --no-startup-id compton -F --opengl --config ~/.config/compton.conf -e 1
  exec_always --no-startup-id polybar-launch
  exec_always --no-startup-id enable_touch
  exec --no-startup-id syndaemon -i 1.0 -t -k
  exec --no-startup-id mpc stop
  exec --no-startup-id mpd_discord_richpresence --no-idle --fork
  exec --no-startup-id nm-applet
  exec --no-startup-id numlockx on
  #+end_example

  My  travel  laptop  has  a  fingerprint   reader  which  can  be  used  as  an
  authentification  method when  the root  password is  asked. Let’s  launch our
  policy kit manager if that is the case:
  #+NAME: fingerprint-thinkpad
  #+BEGIN_SRC emacs-lisp
    (if (string= system-name "gampo")
        "exec --no-startup-id /usr/lib/mate-polkit/polkit-mate-authentication-agent-1"
      "")
  #+END_SRC

  #+BEGIN_SRC conf
    <<fingerprint-thinkpad()>>
    <<generate-autolaunch()>>
  #+END_SRC
